#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_iot_policy.publish will be updated in-place
  ~ resource "aws_iot_policy" "publish" {
        arn                = "arn:aws:iot:us-east-2:623515640582:policy/publish-policy"
        default_version_id = "2"
        id                 = "publish-policy"
      ~ name               = "publish-policy" -> (known after apply)
        policy             = jsonencode(
            {
                Statement = [
                    {
                        Action   = [
                            "iot:Connect",
                            "iot:Publish",
                        ]
                        Effect   = "Allow"
                        Resource = [
                            "*",
                        ]
                    },
                ]
                Version   = "2012-10-17"
            }
        )
    }

  # aws_iot_policy_attachment.publish_to_cert must be replaced
-/+ resource "aws_iot_policy_attachment" "publish_to_cert" {
      ~ id     = "publish-policy|arn:aws:iot:us-east-2:623515640582:cert/bd7514957fef18605c009124f9983dc45ac42a74f39a5be27d35f08f4cb32781" -> (known after apply)
      ~ policy = "publish-policy" -> (known after apply) # forces replacement
        target = "arn:aws:iot:us-east-2:623515640582:cert/bd7514957fef18605c009124f9983dc45ac42a74f39a5be27d35f08f4cb32781"
    }

  # random_string.policy_id will be created
  + resource "random_string" "policy_id" {
      + id          = (known after apply)
      + length      = 8
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

Plan: 2 to add, 1 to change, 1 to destroy.
```

</details>

*Workflow: `terraform validate`, Action: `hashicorpterraform-github-actions4`, Working Directory: `deployments/terraform`, Workspace: `dev`*
